export const courseDescriptionHi = [
    {
      title: "जावास्क्रिप्ट बुनियादी",
      description:
        "JavaScript बेसिक्स को समझें, जिसमें वेरिएबल्स, डेटा टाइप्स, और कंट्रोल फ्लो जैसे मुख्य अवधारणाओं का निर्माण किया जाता है, जो उन्नत अवधारणाओं के लिए एक मजबूत आधार बनाता है।",
    },
    {
      title: "आधुनिक जावास्क्रिप्ट (ES6+)",
      description:
        "ES6+ फीचर्स जैसे एरो फंक्शन्स, डिस्ट्रक्चरिंग, और मॉड्यूल्स के साथ आधुनिक जावास्क्रिप्ट में डूबे, जो आपके कोड की पठनीयता और कुशलता को बढ़ाता है।",
    },
    {
      title: "अतुल्यकालिक प्रोग्रामिंग",
      description:
        "प्रमिसेस, एसिंक/अवेट, और घटना लूप मेकेनिज़्म का उपयोग करके एसिंक्रोनस प्रोग्रामिंग को मास्टर करें, जो आपको प्रतिक्रियाशील और कुशल एप्लिकेशन बनाने की क्षमता प्रदान करता है।",
    },
    {
      title: "ऑब्जेक्ट-ओरिएंटेड प्रोग्रामिंग (ओओपी)",
      description:
        "जावास्क्रिप्ट में ओओपी के सिद्धांतों का अन्वेषण करें, जिसमें इनकैप्सुलेशन, इनहेरिटेंस, और पॉलीमॉर्फिज़म को समझा जाता है, जो विस्तारयोजनात्मक और रखरखावी कोड बनाने के लिए होता है।",
    },
    {
      title: "कार्यात्मक प्रोग्रामिंग",
      description:
        "फंक्शनल प्रोग्रामिंग की अवधारणाओं को स्वीकार करें, जो हायर-आर्डर फंक्शन्स, क्लोज़र्स, और अमूर्तता का उपयोग करके साफ और मॉड्यूलर कोड लिखने के लिए होता है।",
    },
  ];
  
  export const benefitItemsHi = [
    "React जावास्क्रिप्ट लाइब्रेरी के मूल अवधारणाओं और सिद्धांतों को समझें।",
    "सीखें कि React एप्लिकेशन को बाह्य API से कैसे कनेक्ट करें और असिंक्रोनस डेटा को कैसे प्रबंधित करें।",
    "राज्य और प्रॉप्स का हैंडलिंग मास्टर करें, जो React कॉम्पोनेंट विकास के लिए मौलिक है।",
    "React राउटर का उपयोग करके सिंगल-पेज एप्लिकेशन में रूटिंग और नेविगेशन को कैसे लागू करें।",
    "स्केलेबल एप्लिकेशन बनाने में कॉम्पोनेंट-आधारित आर्किटेक्चर के महत्व को समझें।",
    "आधुनिक और कुशल विकास के लिए रियेक्ट हुक्स और फंक्शनल कॉम्पोनेंट्स में डूबें।",
  ];
  
  export const courseTagHi = [
    "रिएक्ट जेएस",
    "एचटीएमएल",
    "सीएसएस",
    "जावास्क्रिप्ट",
  ];
  
  export const courseDataHi = [
    { label: "अपडेट:", value: "April 23, 2024", colorScheme: "gray" },
    { label: "व्याख्यान:", value: 7, colorScheme: "gray" },
    { label: "कौशल स्तर:", value: "इंटरमीडिएट", colorScheme: "gray" },
    { label: "भाषा:", value: "अंग्रेज़ी", colorScheme: "gray" },
    { label: "कोर्स अवधि:", value: "20 घंटे 15 मिनट", colorScheme: "gray" },
  ];
  
  export const modulesHi = [
    {
      id: 1,
      title: "रिएक्ट का परिचय",
      topics: [
        {
          title: "रिएक्ट की शुरुआत",
          duration: "20 मिनट",
        },
        {
          title: "जेएसएक्स और प्रॉप्स",
          duration: "10 मिनट",
        },
      ],
    },
    {
      id: 2,
      title: "उन्नत रिएक्ट पैटर्न",
      topics: [
        {
          title: "हुक्स और फंक्शनल कॉम्पोनेंट्स",
          duration: "15 मिनट",
        },
        {
          title: "संदर्भ एपीआई",
          duration: "30 मिनट",
        },
      ],
    },
    {
      id: 3,
      title: "जेएसएक्स और प्रॉप्स",
      topics: [
        {
          title: "रीडक्स परिचय",
          duration: "25 मिनट",
        },
        {
          title: "रिएक्ट के साथ रीडक्स",
          duration: "20 मिनट",
        },
      ],
    },
  ];
  
  export const courseCardDataHi = [
    {
      id: "1",
      title: "कौशल विकास प्रशिक्षण कार्यक्रम",
      description: "आवश्यक कौशलों को विकसित और मजबूत करने के लिए अवसर और ज्ञान",
      image:
        "https://img.freepik.com/free-photo/medium-shot-man-wearing-vr-glasses_23-2149126949.jpg?t=st=1715078256~exp=1715081856~hmac=a92cc1709dc1b17d0fc7513aa2b14240b81d878e4de649dd5c0ca0e487a9fb1b&w=1380",
      provider: "ONEST अकादमी",
      rating: "4.3",
      logo: "favicon.png",
    },
    {
      id: "2",
      title: "कौशल विकास प्रशिक्षण कार्यक्रम",
      description: "आवश्यक कौशलों को विकसित और मजबूत करने के लिए अवसर और ज्ञान",
      image:
        "https://img.freepik.com/free-photo/front-view-stacked-books-graduation-cap-open-book-education-day_23-2149241017.jpg?t=st=1715077226~exp=1715080826~hmac=0f0e6f5080aef78b988afa0a19bd78fdfbf31ffda2a7506599749bc43d2aa3bc&w=1060",
      provider: "ONEST अकादमी",
      rating: "4.3",
      logo: "favicon.png",
    },
    {
      id: "3",
      title: "कौशल विकास प्रशिक्षण कार्यक्रम",
      description: "आवश्यक कौशलों को विकसित और मजबूत करने के लिए अवसर और ज्ञान",
      image:
        "https://img.freepik.com/free-photo/learning-education-ideas-insight-intelligence-study-concept_53876-120116.jpg?t=st=1715077291~exp=1715080891~hmac=fb3f866ee98db24f4945801800997fda532ea0f9b52624aed21ef08ba5818bf1&w=1380",
      provider: "ONEST अकादमी",
      rating: "4.3",
      logo: "favicon.png",
    },
    {
      id: "4",
      title: "कौशल विकास प्रशिक्षण कार्यक्रम",
      description: "आवश्यक कौशलों को विकसित और मजबूत करने के लिए अवसर और ज्ञान",
      image:
        "https://img.freepik.com/free-photo/person-front-computer-working-html_23-2150040428.jpg?t=st=1715077432~exp=1715081032~hmac=af77f92bc850d234de5263f972c6b5bec605865309eb69b4c4b8266b1328b20d&w=1060",
      provider: "ONEST अकादमी",
      rating: "4.3",
      logo: "favicon.png",
    },
  ];
  
  export const advantagesHi = [
    {
      title: "विशेष शिक्षण अनुभव:",
      description:
        "हम विशेष रूप से तैयार किए गए शैक्षिक कार्यक्रम प्रदान करते हैं जो सभी सहभागियों को नेटवर्क के साथ ठीक से परिचित कराते हैं।",
    },
    {
      title: "गहरा मार्गदर्शन:",
      description:
        "सहभागियों को प्रभावी रूप से नेटवर्क को नेविगेट करने के लिए व्यापक मार्गदर्शन प्राप्त होता है।",
    },
    {
      title: "सर्वोत्तम अनुशासन: ",
      description:
        "हम सफल ई-कॉमर्स यात्रा सुनिश्चित करने के लिए प्रमाणित रणनीतियों और अभ्यासों को साझा करते हैं।",
    },
    {
      title: "कम रोड़कट:",
      description:
        "हमारा उद्देश्य है कि सहभागियों को वनेस्ट नेटवर्क पर कम समस्याएं और स्मूद आपरेशन अनुभव कराने में मदद करें।",
    },
  ];
  
  export const empowerHi = [
    {
      src: "https://cdn-icons-png.flaticon.com/128/9710/9710166.png",
      alt: "Decision Icon",
      desc: "सूचित निर्णय लें",
    },
    {
      src: "https://cdn-icons-png.flaticon.com/128/10970/10970304.png",
      alt: "Strategy Icon",
      desc: "अपना ऑनलाइन व्यापार कुशलतापूर्वक चलाएं",
    },
    {
      src: "https://cdn-icons-png.flaticon.com/128/10831/10831333.png",
      alt: "Analysis Icon",
      desc: "आपके प्रयासों पर उत्तरों को अधिकतम करें",
    },
  ];
  
  export const bannerDescHi =
    "एकेडमी में, विश्वसनीयता गुणवत्ता कंटेंट, पारदर्शिता, और छात्र सफलता के समर्थन के माध्यम से बनती है, जो सहयोग और विकास को प्रोत्साहित करती है।";
  
  export const bannerTitleHi =
    "सत्यापन स्थापित करना: नेटवर्क के भीतर विश्वास और सहयोग बढ़ाना";
  
  export const welcomeHi = "ONEST अकादमी में आपका स्वागत है";
  
  export const interveneHi = "ONEST अकादमी आपको सशक्त बनाएगी:";
  
  export const welcomeDescHi =
    "ONEST नेटवर्क पर कार्यात्मक उत्कृष्टता की ओर आपका पथ। नेटवर्क स्थापित करने के प्रारंभिक चरण में, हमने पहली बार ई-कॉमर्स के लिए ओपन प्रोटोकॉल का उपयोग करते समय सहभागियों द्वारा कई चुनौतियों को पहचाना।";
  
  export const onestEmpowerHi =
    "ONEST अकादमी आपको निम्नलिखित के लिए सशक्त बनाएगी:";
  
  export const aboutCourse1Hi =
    "हमारे रिएक्ट फ्रंट टू बैक के साथ एक व्यापक रिएक्ट यात्रा शुरू करें अवधि। इसे शुरुआती और अनुभवी डेवलपर्स दोनों के लिए डिज़ाइन किया गया है पाठ्यक्रम बुनियादी बातों को शामिल करता है और उन्नत विषयों में गहराई से उतरता है। इंटरैक्टिव यूजर इंटरफेस बनाने से लेकर राज्य प्रबंधन तक एपीआई के साथ एकीकरण करके, आपको व्यावहारिक अनुभव प्राप्त होगा। अपना उत्थान करें प्रतिक्रिया कौशल और वेब विकास प्रवृत्तियों में सबसे आगे रहें यह गहन और व्यावहारिक सीखने का अनुभव।";
  
  export const aboutCourse2Hi =
    "हमारे रिएक्ट फ्रंट टू बैक के साथ एक व्यापक रिएक्ट यात्रा शुरू करें अवधि। इसे शुरुआती और अनुभवी डेवलपर्स दोनों के लिए डिज़ाइन किया गया है पाठ्यक्रम बुनियादी बातों को शामिल करता है और उन्नत विषयों में गहराई से उतरता है। इंटरैक्टिव यूजर इंटरफेस बनाने से लेकर राज्य प्रबंधन तक एपीआई के साथ एकीकरण करके, आपको व्यावहारिक अनुभव प्राप्त होगा। अपना उत्थान करें प्रतिक्रिया कौशल और वेब विकास प्रवृत्तियों में सबसे आगे रहें यह गहन और व्यावहारिक सीखने का अनुभव।";
  
  